# [ DataFrame 인덱스 다루기 ]

## (1) 새로운 인덱스 설정 : 컬럼 ==> 인덱스 설정

### <hr> (1) 모듈로딩

In [60]:
import pandas as pd

### <hr> (2) 데이터 준비

In [61]:
# dict 타입의 데이터 생성
exam = { '이름' : ['김재중', '김현아', '조현아', '이창민'],
         '국어' : [78, 89 , 99, 29],
         '수학' : [98, 49 , 89, 99],
         '영어' : [98, 89 , 39, 49],
         '과학' : [18, 69 , 79, 89] }

### <hr> (3) 데이터 저장

In [62]:
examDF=pd.DataFrame(exam)

### <hr> (4) 데이터 확인

In [63]:
examDF

    이름  국어  수학  영어  과학
0  김재중  78  98  98  18
1  김현아  89  49  89  69
2  조현아  99  89  39  79
3  이창민  29  99  49  89

### <hr> (5) 새로운 인덱스 설정 방법 1

방법 1. 인덱스 일부 변경 DF.rename() - 일부 메소드는 inplace를 가지고 있음

In [64]:
# 행 인덱스 일부 변경 => index = {기존 인덱스 : 새로운 인덱스}
examDF.rename(index={0:'zero'}) # 카피본만 보여줌

       이름  국어  수학  영어  과학
zero  김재중  78  98  98  18
1     김현아  89  49  89  69
2     조현아  99  89  39  79
3     이창민  29  99  49  89

In [65]:
examDF # 원본 안바뀜

    이름  국어  수학  영어  과학
0  김재중  78  98  98  18
1  김현아  89  49  89  69
2  조현아  99  89  39  79
3  이창민  29  99  49  89

In [66]:
# inplace 매개변수/파라미터 
# => 원본 DataFrame에 변경 여부 결정, 기본은 원본 변경 안함 False!!
examDF.rename(index={0:'zero'}, inplace=True)

In [67]:
examDF

       이름  국어  수학  영어  과학
zero  김재중  78  98  98  18
1     김현아  89  49  89  69
2     조현아  99  89  39  79
3     이창민  29  99  49  89

In [68]:
# 열 이름 인덱스 일부 변경 => column = {기존 인덱스 : 새로운 인덱스}
examDF.rename(columns={'수학':'math'}) # 카피본만 보여줌

       이름  국어  math  영어  과학
zero  김재중  78    98  98  18
1     김현아  89    49  89  69
2     조현아  99    89  39  79
3     이창민  29    99  49  89

In [69]:
examDF.columns

Index(['이름', '국어', '수학', '영어', '과학'], dtype='object')

In [70]:
examDF.rename(columns={'수학':'math'}, inplace=True)

In [102]:
examDF

       이름  국어  math  영어  과학
zero  김재중  78    98  98  18
1     김현아  89    49  89  69
2     조현아  99    89  39  79
3     이창민  29    99  49  89

### <hr> (5) 새로운 인덱스 설정 방법 2

<hr> 방법 2. 특정 컬럼 => 인덱스 : DF.set_index()

In [72]:
# 현재 긱본 0~ ==> 이름 컬럼 인덱스로 사용
examDF.index

Index(['zero', 1, 2, 3], dtype='object')

In [80]:
# 1개 컬럼을 인덱스로 설정. 단, inplace 파라메터가 False로 원본 적용 안됨!
examDF2 = examDF.set_index('이름') # copy본 사용
examDF2

     국어  math  영어  과학
이름
김재중  78    98  98  18
김현아  89    49  89  69
조현아  99    89  39  79
이창민  29    99  49  89

In [81]:
examDF

       이름  국어  math  영어  과학
zero  김재중  78    98  98  18
1     김현아  89    49  89  69
2     조현아  99    89  39  79
3     이창민  29    99  49  89

In [75]:
# examDF.set_index('이름', inplace=True)

In [76]:
examDF

       이름  국어  math  영어  과학
zero  김재중  78    98  98  18
1     김현아  89    49  89  69
2     조현아  99    89  39  79
3     이창민  29    99  49  89

In [96]:
# 2개의 칼럼을 행 인덱스 설정. 단, inplace 파라메터가 False로 원본에 적용 안 됨!
# examDF3 = examDF.set_index(['이름', '국어', '수학']) #이 버전에서 에러

In [97]:
examDF2.index

Index(['김재중', '김현아', '조현아', '이창민'], dtype='object', name='이름')

In [98]:
examDF2.loc['김재중']

국어      78
math    98
영어      98
과학      18
Name: 김재중, dtype: int64

In [99]:
# examDF3 = examDF.set_index(['이름','국어','수학'])
# examDF3.index # 이 버전에서 에러

In [101]:
# examDF3.loc['김재중']

In [ ]:
# KeyError => '김재중,78,98' 형식으로 78로 시작하는 Key 없음
# examDF3.loc[78,98] # 순차적으로 검색하기 때문에 '이름'없이 검색 시작이 안됨

### <hr> (5) 새로운 인덱스 설정 방법 3

In [109]:
# 현재 행 인덱스 ==> 컬럼으로 추가
df1 = examDF.reset_index().reset_index()
df1

   index   이름  국어  math  영어  과학
0      0  김재중  78    98  98  18
1      1  김현아  89    49  89  69
2      2  조현아  99    89  39  79
3      3  이창민  29    99  49  89

In [111]:
# 현재 행 인덱스를 컬럼에 추가하지 않고 삭제 => drop 파라미터를 True로 설정
df2 = examDF.reset_index(drop=True)
df2

   국어  math  영어  과학
0  78    98  98  18
1  89    49  89  69
2  99    89  39  79
3  29    99  49  89